$(document).ready(function(){
    $(".num").change(function(){
        let value = $(this).val();
        if(value){
            $(".result").html(number_to_string(value));
        }
    });
});

/**
 *
 Վերադարձնում է գումարը բառերով
 */
function number_to_string (num) {
    let def_translite = {
        null: 'զրո',
        a1: ['մեկ', 'երկու', 'երեք', 'չորս', 'հինգ', 'վեց', 'յոթ', 'ութ', 'ինը'],
        a2: ['մեկ', 'երկու', 'երեք', 'չորս', 'հինգ', 'վեց', 'յոթ', 'ութ', 'ինը'],
        a10: ['տաս', 'տասնմեկ', 'տասներկու', 'տասներեք', 'տասնչորս', 'տասնհինգ', 'տասնվեց', 'տասնյոթ', 'տասնութ', 'իննսուն'],
        a20: ['քսան', 'երեսուն', 'քառասուն', 'հիսուն', 'վաթսուն', 'յոթանասուն', 'ութսուն', 'իննսուն'],
        a100: ['հարյուր', 'երկու հարյուր', 'երեք հարյուր', 'չորս հարյուր', 'հինգ հարյուր', 'վեց հարյուր', 'յոթ հարյուր', 'ութ հարյուր', 'ինը հարյուր'],
        uc: ['լումա', 'լումա', 'լումա'],
        ur: ['դրամ', 'դրամ', 'դրամ'],
        u4: ['հազար', 'հազար', 'հազար'],
        u3: ['միլիոն', 'միլիոն', 'միլիոն'],
        u2: ['միլիարդ', 'միլիարդ', 'միլիարդ'],
        u1: ['տրիլիոն', 'տրիլիոն', 'տրիլիոն'],
    };
    let luma_translite = {
        1: 'մեկ',2: 'երկու',3: 'երեք',4: 'չորս',5: 'հինգ',6: 'վեց',7: 'յոթ',8: 'ութ',9: 'ինը',10: 'տաս',
        11: 'տասնմեկ',12: 'տասներկու',13: 'տասներեք',14: 'տասնչորս',15: 'տասնհինգ',16: 'տասնվեց',17: 'տասնյոթ',18: 'տասնութ',19: 'տասն',20: 'քսան',
        21: 'քսանմեկ',22: 'քսաներկու',23: 'քսաներեք',24: 'քսանչորս',25: 'քսանհինգ',26: 'քսանվեց',27: 'քսանյոթ',28: 'քսանութ',29: 'քսանինը',30: 'երեսուն',
        31: 'երեսունմեկ',32: 'երեսուներկու',33: 'երեսուներեք',34: 'երեսունչորս',35: 'երեսունհինգ',36: 'երեսունվեց',37: 'երեսունյոթ',38: 'երեսունութ',39: 'երեսունինը',40: 'քառասուն',
        41: 'քառասունմեկ',42: 'քառասուներկու',43: 'քառասուներեք',44: 'քառասունչորս',45: 'քառասունհինգ',46: 'քառասունվեց',47: 'քառասունյոթ',48: 'քառասունութ',49: 'քառասունինը',50: 'հիսուն',
        51: 'հիսունմեկ',52: 'հիսուներկու',53: 'հիսուներեք',54: 'հիսունչորս',55: 'հիսունհինգ',56: 'հիսունվեց',57: 'հիսունյոթ',58: 'հիսունութ',59: 'հիսունինը',60: 'վաթսուն',
        61: 'վաթսունմեկ',62: 'վաթսուներկու',63: 'վաթսուներեք',64: 'վաթսունչորս',65: 'վաթսունհինգ',66: 'վաթսունվեց',67: 'վաթսունյոթ',68: 'վաթսունութ',69: 'վաթսունինը',70: 'յոթանասուն',
        71: 'յոթանասունմեկ',72: 'յոթանասուներկու',73: 'յոթանասուներեք',74: 'յոթանասունչորս',75: 'յոթանասունհինգ',76: 'յոթանասունվեց',77: 'յոթանասունյոթ',78: 'յոթանասունութ',79: 'յոթանասունինը',80: 'ութսուն',
        81: 'ութսունմեկ',82: 'ութսուներկու',83: 'ութսուներեք',84: 'ութսունչորս',85: 'ութսունհինգ',86: 'ութսունվեց',87: 'ութսունյոթ',88: 'ութսունութ',89: 'ութսունինը',90: 'իննսուն',
        91: 'իննսունմեկ',92: 'իննսուներկու',93: 'իննսուներեք',94: 'իննսունչորս',95: 'իննսունհինգ',96: 'իննսունվեց',97: 'իննսունյոթ',98: 'իննսունութ',99: 'իննսունինը',
    };
    let i1, i2, i3, luma, out, dram, v, zeros, _ref, _ref1, _ref2, ax;

    _ref = parseFloat(num).toFixed(2).split('.'),
        dram = _ref[0],
        luma = _ref[1];
    let leading_zeros = 15 - dram.length;
    if (leading_zeros < 0) {
        return false;
    }

    zeros = [];
    while (leading_zeros--) {
        zeros.push('0');
    }
    dram = zeros.join('') + dram;

    out = [];
    if (dram > 0) {
        // բաժանում ենք տիվը երեք մասի
        _ref1 = str_split(dram, 3);

        for (let i = -1; i < _ref1.length; i++) {
            v = _ref1[i];
            if (!(v > 0)) continue;
            _ref2 = str_split(v, 1),
                i1 = parseInt(_ref2[0]),
                i2 = parseInt(_ref2[1]),
                i3 = parseInt(_ref2[2]);
            console.log(def_translite.a100[i1-1]);
            out.push(def_translite.a100[i1-1]); // 1xx-9xx
            ax = (i+1 === 3) ? 'a2' : 'a1';
            if (i2 > 1) {
                out.push(def_translite.a20[i2-2] + (i3 > 0 ?  ' ' + def_translite[ax][i3-1] : '')); // 20-99
            } else {
                out.push(i2 > 0 ? def_translite.a10[i3] : def_translite[ax][i3-1]); // 10-19 | 1-9
            }

            if (_ref1.length > i+1){
                let name = def_translite['u' + (i + 1)];
                out.push(morph(v,name));
            }
        }
    } else {
        out.push(def_translite.null);
    }
    // ավելացնւմ ենք դրամ բառը
    out.push(morph(dram, def_translite.ur));

    // ավելացնւմ ենք լուման բառը
    if(luma.split('')[0] == 0){
        switch (luma) {
            case '00':
                lumaNumber = "զրո";
                break;
            case '01':
                lumaNumber = "մեկ";
                break;
            case '02':
                lumaNumber = "եթկու";
                break;
            case '03':
                lumaNumber = "երեք";
                break;
            case '04':
                lumaNumber = "չորս";
                break;
            case '05':
                lumaNumber = "հինգ";
                break;
            case '06':
                lumaNumber = "վեց";
                break;
            case '07':
                lumaNumber = "յոթ";
                break;
            case '08':
                lumaNumber = "ութ";
                break;
            case '09':
                lumaNumber = "ինը";
        }
    }else{
        lumaNumber = luma_translite[luma];
    }
    out.push(lumaNumber + ' ' + morph(luma, def_translite.uc));


    return out.join(' ').replace(RegExp(' {2,}', 'g'), ' ').trimLeft();
};

function morph(number, titles) {
    let cases = [2, 0, 1, 1, 1, 2];
    return titles[ (number%100>4 && number%100<20)? 2 : cases[Math.min(number%10, 5)] ];
};

/**
 *
 Տողը վերափոխում է զանգվածի
 */
function str_split(string, length) {
    let chunks, len, pos;

    string = (string == null) ? "" : string;
    length =  (length == null) ? 1 : length;

    chunks = [];
    pos = 0;
    len = string.length;
    while (pos < len) {
        chunks.push(string.slice(pos, pos += length));
    }

    return chunks;
};